//Создайте класс Building с следующими свойствами:
//BuildingName(название здания, строковое)
//Height(высота здания в метрах, числовое)
//Floors(количество этажей, числовое)
//TotalArea(общая площадь в квадратных метрах, числовое)
//Locaon(местоположение здания, строковое)
//Определите метод CalculateVolume(), который будет вычислять объем здания. Объем можно приближенно рассчитать, умножив высоту здания на его общую площадь. Метод должен возвращать объем в кубических метрах.
//Создайте массив из 3 зданий, задав разные характеристики для каждого.
//Определите делегат с сигнатурой для метода CalculateVolume.
//Создайте метод, который принимает массив зданий и делегат, а затем вызывает метод CalculateVolume для каждого здания в массиве с помощью делегата. Выведите результаты расчетов на экран.

