//TaskManager

//Название проекта: Разработка системы управления задачами "TaskManager"

//Цель проекта: Создать программный продукт для эффективного управления задачами и проектами с использованием объектно-ориентированной парадигмы.

//Общее описание проекта:
//Система управления задачами "TaskManager" представляет собой приложение, предназначенное для организации и управления задачами и проектами в офисной среде. Продукт должен быть разработан с использованием принципов и методологии объектно-ориентированного программирования (ООП) для обеспечения гибкости, расширяемости и удобства использования.

//Основные функциональные требования:
//● Регистрация пользователей с различными уровнями доступа (администратор, обычный пользователь).
//● Создание, редактирование и удаление задач и проектов.
//● Присвоение задачам статусов (выполнено, в процессе, отложено и т. д.).
//● Установка сроков выполнения задач и уведомление пользователей о приближающихся дедлайнах.
//● Поиск и фильтрация задач по различным критериям (приоритет, статус, срок выполнения).
//● Генерация отчетов и статистики по выполненным задачам и проектам.

