//1. Напишите программу со статическим методом, аргументом которому передается целочисленный массив, а результатом возвращается среднее значение для элементов массива (сумма значений элементов, деленная на количество элементов в массиве).
using Lesson6_DZ_;
using System.Text;
using MyPrint = System.Console;

//Massiv mass = new Massiv(35);

//int[] mas = new int[35];
//Random random = new Random();

//for (int i = 0; i < 23; i++)
//{
//    mas[i] = random.Next(1, 50);
//}
//Massiv.Avg(mas);
//Massiv.Main(mas);


//2. Напишите программу со статическим методом, аргументом которому передается одномерный символьный массив. В результате вызова метода элементы массива попарно меняются местами: первый - с последним, второй - с предпоследним и так далее.

CharArray charArray = new CharArray('x', 'y', 'z');
char[] c = ['a', 'b', 'c',];
CharArray.Main(c);